jail-root-detection.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-14 Sat 16:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content" class="content">
<ul class="org-ul">
<li><a href="index.html">home</a></li>
</ul>
<div id="outline-container-org2c91f3b" class="outline-2">
<h2 id="org2c91f3b">Jailbreak and Root Detection</h2>
<div class="outline-text-2" id="text-org2c91f3b">
<p>
When I'm testing mobile applications, as part of static analysis, I always check to see if the application may give me a hard time running on rooted or jailbroken devices. This normally includes searching for <i>common</i> detection strings like "Cydia" within the compiled application, for example;
</p>

<div class="org-src-container">
<pre class="src src-shell">strings ~/Downloads/UnCrackable_Level_2/Payload/UnCrackable<span style="font-style: italic;">\ </span>Level<span style="font-style: italic;">\ </span>2.app/UnCrackable<span style="font-style: italic;">\ </span>Level<span style="font-style: italic;">\ </span>2 | grep Cydia
</pre>
</div>

<pre class="example">
/Applications/Cydia.app
/Applications/Cydia.app
</pre>


<p>
Over time this of <i>common</i> strings has got quite long, and I end up making a new list for each project.
</p>

<p>
Another way I like to look for these <i>common</i> detection strings is by searching with <code>radare2</code>, for example;
</p>

<div class="org-src-container">
<pre class="src src-shell">r2 -c izzq~+Cydia ~/Downloads/UnCrackable_Level_2/Payload/UnCrackable<span style="font-style: italic;">\ </span>Level<span style="font-style: italic;">\ </span>2.app/UnCrackable<span style="font-style: italic;">\ </span>Level<span style="font-style: italic;">\ </span>2
</pre>
</div>

<pre class="example">
0xeea1 24 23 /Applications/Cydia.app
0xef20 36 35 cydia://package/com.example.package
</pre>
</div>

<div id="outline-container-orge896072" class="outline-3">
<h3 id="orge896072">Automate the boring stuff</h3>
<div class="outline-text-3" id="text-orge896072">
<p>
So I wanted to have a standard script that I could run that would do this for me, both with <code>radare2</code> and with <code>strings</code>. I also wanted this to work for Android applications. So after little thought, I decided to use <code>python</code> and specifically the <code>r2pipe</code> library to interact with <code>radare2</code> and then using the <code>sh</code> library fall back to <code>strings</code>.
</p>

<p>
I ended up with this function
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">string_search</span>(app, strings):
    <span style="font-weight: bold;">for</span> string <span style="font-weight: bold;">in</span> <span style="font-weight: bold; font-style: italic;">strings</span>:
        <span style="font-weight: bold;">try</span>:
            r_pipe = r2pipe.<span style="font-weight: bold;">open</span>(app)
            <span style="font-weight: bold; font-style: italic;">r_strings</span> = r_pipe.cmd(<span style="font-style: italic;">'izzq~+{}'</span>.<span style="font-weight: bold;">format</span>(string))
            <span style="font-weight: bold;">if</span> r_strings:
                <span style="font-weight: bold;">yield</span> r_strings
        <span style="font-weight: bold;">except</span> <span style="font-weight: bold; text-decoration: underline;">Exception</span>:
            <span style="font-weight: bold;">pass</span>

    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">/bin/strings if radare2 fails</span>
    <span style="font-weight: bold; font-style: italic;">sh_strings</span> = sh.strings(app)
    <span style="font-weight: bold;">for</span> line <span style="font-weight: bold;">in</span> sh_strings:
        <span style="font-weight: bold;">for</span> string <span style="font-weight: bold;">in</span> strings:
            <span style="font-weight: bold;">if</span> string <span style="font-weight: bold;">in</span> line:
                <span style="font-weight: bold;">yield</span> line
</pre>
</div>

<p>
Nice, now that the searching function is complete, I added this function to handle user arguments.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">get_args</span>():
    <span style="font-weight: bold; font-style: italic;">parser</span> = argparse.ArgumentParser(description=<span style="font-style: italic;">'[+] root &amp; jailbreak detection'</span>)
    group = parser.add_mutually_exclusive_group(required=<span style="font-weight: bold; text-decoration: underline;">True</span>)
    group.add_argument(<span style="font-style: italic;">'--dex'</span>, <span style="font-weight: bold;">help</span>=<span style="font-style: italic;">'path to android dex file'</span>)
    group.add_argument(<span style="font-style: italic;">'--ios'</span>, <span style="font-weight: bold;">help</span>=<span style="font-style: italic;">'path to extracted payload binary'</span>)
    <span style="font-weight: bold;">return</span> parser.parse_args()
</pre>
</div>

<p>
And then depending option selected by the user, would result in which set of stings get imported at run-time.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">if</span> args.<span style="font-weight: bold; font-style: italic;">dex</span>:
    app = args.dex
    <span style="font-weight: bold;">from</span> jailrootdetector.detections <span style="font-weight: bold;">import</span> root_strings
    <span style="font-weight: bold; font-style: italic;">strings</span> = root_strings
<span style="font-weight: bold;">elif</span> args.<span style="font-weight: bold; font-style: italic;">ios</span>:
    app = args.ios
    <span style="font-weight: bold;">from</span> jailrootdetector.detections <span style="font-weight: bold;">import</span> jailbreak_strings
    <span style="font-weight: bold; font-style: italic;">strings</span> = jailbreak_strings
<span style="font-weight: bold;">else</span>:
    sys.<span style="font-weight: bold; text-decoration: underline;">exit</span>()

<span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'\n[+] searching\n'</span>)
<span style="font-weight: bold; font-style: italic;">search_results</span> = <span style="font-weight: bold;">set</span>(string_search(app, strings))
<span style="font-weight: bold;">if</span> search_results:
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'[+] detection strings found:'</span>)
    <span style="font-weight: bold;">for</span> string <span style="font-weight: bold;">in</span> search_results:
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'{}'</span>.<span style="font-weight: bold;">format</span>(string.strip()))
<span style="font-weight: bold;">else</span>:
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'[+] no detection strings found in: {}'</span>.<span style="font-weight: bold;">format</span>(app))
</pre>
</div>

<p>
This works well, but it did not quite hit the mark, I wanted this to be callable ate the users shell prompt, and not have to <code>cd</code> into this project directory to run one small script.
</p>
</div>

<div id="outline-container-org5601d8d" class="outline-4">
<h4 id="org5601d8d">Python Poetry</h4>
<div class="outline-text-4" id="text-org5601d8d">
<p>
I was using <code>poetry</code> to manage the <code>virtualenv</code> and any other dependencies of this script, so I initially looked at the documentation to see how I could have this installed to the users <code>$PATH</code>, and discovered the <code>tool.poetry.scripts</code> in the <code>pyproject.toml</code> file. This was exactly what I was looking for, so I added in the following;
</p>

<pre class="example" id="org0ee30e9">
[tool.poetry.scripts]
jrd = "jailrootdetector.main:main"
</pre>

<p>
This now means users can install the script and then call it with <code>jrd --help</code>, amazing!!
</p>
</div>
</div>
</div>

<div id="outline-container-org6eb5c72" class="outline-3">
<h3 id="org6eb5c72">PyPi</h3>
<div class="outline-text-3" id="text-org6eb5c72">
<p>
All that was left was to upload this to PyPi so people could install it with <code>pip</code> or <code>pipx</code>. <code>poetry</code> also helped here too with the <code>poetry publish --build</code> command.
</p>

<p>
Now that the script had been uploaded to PyPi, its as simple as <code>pip(3|x) install jailrootdetector</code>, like so;
</p>

<div class="org-src-container">
<pre class="src src-shell">pipx install jailrootdetector
</pre>
</div>

<p>
And then call <code>jrd</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell">jrd --help
</pre>
</div>

<pre class="example" id="org38d04a4">
usage: jrd [-h] (--dex DEX | --ios IOS)

[+] root &amp; jailbreak detection

optional arguments:
  -h, --help  show this help message and exit
  --dex DEX   path to android dex file
  --ios IOS   path to extracted payload binary
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
